SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( 4SUB_4111_BRGn_MTB_10961
 Type ( Engine )
 WagonShape ( 4SUB_4111_BRGn_MTB_10961.S )
  
 Size  ( 2.86512m 4.13972m 19.62m )
 CentreOfGravity ( 0.0m 0.0m 0.05m )
 Mass ( 78t )
 WheelRadius ( 0.5m )
 InertiaTensor ( Box ( 2.86512m 4.13972m 19.6m ) )
 Coupling (
  Type ( Bar )
  Spring (
   Stiffness ( 1e7N/m 1e7N/m )
   Damping ( 0.2e7N/m/s 0.2e7N/m/s )
   Break ( 1e7N 1e7N )
   r0 ( 10cm 1e9 )
  )
  CouplingHasRigidConnection ()
  Velocity (0.1m/s)
  CouplingUniqueType (2BIL)
 )
 
 Coupling (
  Type ( Automatic )
  Spring (
   Stiffness ( 1e6N/m 2e6N/m )
   Damping ( 1e6N/m/s 1e6N/m/s )
   Break ( 3.2e6N 3.2e6N )
   r0 ( 20cm 40cm )
  )
 )
 
 Buffers (
  Spring (
   Stiffness ( 1e7N/m 0 )
   Damping ( 1e6N/m/s 0 )
   r0 ( 0m 1e9 )
  )
  Centre ( 0.5 )
  Radius ( 1 )
  Angle ( 0.5deg )
 )

 Adheasion ( 0.2 0.4 2 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 230kN )
 DerailBufferForce ( 200kN )
 NumWheels ( 8 )
 Friction (
  1478N/m/s  0  1mph  14.75N/m/s  1.8
  5.1N/rad/s  1  -1rad/s  0  1
 )

 AntiSlip ()

 MaxBrakeForce ( 180kN )
 BrakeEquipmentType ( "Handbrake, EP_brake" )
 BrakeSystemType ( "EP" )

 MaxHandbrakeForce( 50000N )
 NumberOfHandbrakeLeverSteps( 100 )
 EmergencyBrakeResMaxPressure( 110 )
 TripleValveRatio( 2.5 )
 MaxReleaseRate( 20 )
 MaxApplicationRate( 20 )
 MaxAuxilaryChargingRate( 30 )
 EmergencyResCapacity( 10 )
 EmergencyResChargingRate( 30 )
 BrakeCylinderPressureForMaxBrakeBrakeForce( 70 )
 
 BrakeDistributorFullServicePressure( 82 )
 BrakeDistributorMaxAuxilaryResPressure( 110 )
 BrakeDistributorEmergencyResPressure( 110 )
 BrakeDistributorReleaseRate( 10 )
 BrakeDistributorApplicationRate( 15 )
 BrakeDistributorTrainPipeControlRatio( 2.03 )
 BrakeDistributorNormalFullReleasePressure( 110 )

  Lights ( 3
                 Light (
   comment( Sphere of light - forward )
   Type  ( 1 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    )
   Cycle ( 0 )
   FadeIn ( 0.25 )
   FadeOut ( 0.5 )
   States ( 1
    State (
     Duration ( 0.0 )
     LightColour ( ffffffff )
     Position ( 0 3.5 0 )
     Transition ( 0 )
     Radius ( 80.0 )
     Angle ( 15.0 )
     )
    )
   )
                 Light ( 
                        comment( Pickups ) 
                        Type       ( 0 ) 
                        Conditions ( 
                                Headlight ( 0 )
                                Unit ( 0 )
                                )
                        FadeIn ( 0.5 ) 
                        FadeOut ( 0.5 ) 
                        Cycle ( 0 ) 
                        States ( 4 
                               State ( 
                                     Duration ( 0.1 ) 
                                     LightColour ( 8000ccff ) 
                                     Position ( 1.11343 0.11369 6.7818 )
                                     Azimuth ( 30 30 30 )
                                     Transition ( 0 )
                                     Radius ( 2 )
                                     ) 
                               State ( 
                                     Duration ( 0.1 ) 
                                     LightColour ( 80000000 ) 
                                     Position ( 1.11343 0.11369 6.7818 )
                                     Azimuth ( 30 30 30 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                               State ( 
                                     Duration ( 0.1 ) 
                                     LightColour ( 8000ccff ) 
                                     Position ( 1.11343 0.11369 6.7818 )
                                     Azimuth ( 30 30 30 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                               State ( 
                                     Duration ( 10 ) 
                                     LightColour ( 80000000 )
                                     Position ( 1.11343 0.11369 6.7818 )
                                     Azimuth ( 30 30 30 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                              )
                           )

                    Light ( 
                        comment( Pickups ) 
                        Type       ( 0 ) 
                        Conditions ( 
                                Headlight ( 0 )
                                Unit ( 0 )
                                ) 
                        FadeIn ( 0.5 ) 
                        FadeOut ( 0.5 ) 
                        Cycle ( 0 ) 
                        States ( 4 
                               State ( 
                                     Duration ( 0.3 ) 
                                     LightColour ( 8000ccff ) 
                                     Position ( -1.11343 0.11369 6.46 )
                                     Azimuth ( 150 150 150 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 )
                                     ) 
                               State (
                                     Duration ( 0.3 ) 
                                     LightColour ( 80000000 ) 
                                     Position ( -1.11343 0.11369 6.46 )
                                     Azimuth ( 150 150 150 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                               State ( 
                                     Duration ( 0.3 ) 
                                     LightColour ( 8000ccff ) 
                                     Position ( -1.11343 0.11369 6.46 )
                                     Azimuth ( 150 150 150 )
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                               State ( 
                                     Duration ( 10 ) 
                                     LightColour ( 80000000 ) 
                                     Position ( -1.11343 0.11369 6.46 )
                                     Azimuth ( 150 150 150 ) 
                                     Transition ( 0 ) 
                                     Radius ( 2 ) 
                                     ) 
                              )
                           )
                    )

     Sound (  "..//..//MT_MW.SOUND_EMU//motoreng.sms" )
)

Engine ( 4SUB_4111_BRGn_MTB_10961
    Wagon ( 4SUB_4111_BRGn_MTB_10961 )
    Type ( Electric )
    MaxPower ( 800kW )
 MaxForce ( 200kN#est )
 MaxContinuousForce ( 220kN )
 MaxVelocity ( 76mph )
 MaxCurrent ( 900A )
 WheelRadius ( 0.5m )
 Sanding ( 1e9mph )
 NumWheels ( 1 )

CabView ( 2bil.cvf )
    HeadOut (  -1.5 2.68 8.82 )


 AirBrakesAirCompressorPowerRating( 3 )
 AirBrakesMainMinResAirPressure( 30 )
 AirBrakesMainMaxAirPressure( 100 )
 AirBrakesMainResVolume( 6 )
 AirBrakesAirCompressorWattage( 20000 )
 AirBrakesCompressorRestartPressure( 100 )
 AirBrakesAirUsedPerPoundsOfBrakePipePressure( 0.8 )
 AirBrakesHasLowPressureTest( 1 )
 AirBrakesIsCompressorElectricOrMechanical( 1 )

 TrainBrakesControllerMaxApplicationRate( 30 )
 TrainBrakesControllerMaxReleaseRate( 12 )
 TrainBrakesControllerEmergencyApplicationRate( 65 )
 TrainBrakesControllerMinSystemPressure( 0 )
 TrainBrakesControllerMaxSystemPressure( 90 )
 TrainBrakesControllerEmergencyBrakeTimePenalty( 0 )
 TrainBrakesControllerFullServicePressureDrop( 36 )

 BrakesEngineControllers( "Train" )
 
 EmergencyStopMonitor(
     MonitoringDeviceMonitorTimeLimit( 0 )
      MonitoringDeviceAlarmTimeLimit( 0 )
      MonitoringDevicePenaltyTimeLimit( 0 )
      MonitoringDeviceCriticalLevel( 0 )
      MonitoringDeviceResetLevel( 0 )
      MonitoringDeviceAppliesFullBrake( 0 )
      MonitoringDeviceAppliesEmergencyBrake( 1 )
      MonitoringDeviceAppliesCutsPower( 1 )
      MonitoringDeviceAppliesShutsDownEngine( 0 )
      )

 AWSMonitor(
  MonitoringDeviceMonitorTimeLimit( -1 )
  MonitoringDeviceAlarmTimeLimit( 5 )
  MonitoringDevicePenaltyTimeLimit( 0 )
  MonitoringDeviceCriticalLevel( 0 )
  MonitoringDeviceResetLevel( 0 )
  MonitoringDeviceAppliesFullBrake( 0 )
  MonitoringDeviceAppliesEmergencyBrake( 1 )
  MonitoringDeviceAppliesCutsPower( 0 )
  MonitoringDeviceAppliesShutsDownEngine( 0 )
  )

        EngineControllers (
            Throttle ( 0 1 0.2 0 
                NumNotches ( 6
                Notch ( 0          0 Dummy )
                Notch ( 0.2        0 Dummy )
                Notch ( 0.4        0 Dummy )
                Notch ( 0.6        0 Dummy )
                Notch ( 0.8        0 Dummy )
                Notch ( 1          0 Dummy )
                 )
            )
            Brake_Train ( 0 1 0.0125 0.75 
                NumNotches ( 4
                    Notch( 0    1 TrainBrakesControllerReleaseStart )
                    Notch( 0.10 1 TrainBrakesControllerEPApplyStart )
                    Notch( 0.90 0 TrainBrakesControllerEPHoldStart )
                    Notch( 1.00 0 TrainBrakesControllerEmergencyStart )
                )
            )
            
            EmergencyStopToggle( 0 1 0 )
            Vigilance ( 0 1 0 )
            DirControl ( -1 0 1 1 )
            AWS ( 0 1 0 )
            Horn ( 0 1 0 )
            PantographToggle1 ( 0 1 1 )
  Headlights ( 0 0.25 1 0 )
            Wipers ( 0 1 0 )
        )
        
     Sound ( "..//..//MT_MW.SOUND_EMU//motorcab.sms"  )

     Name ( "4SUB_4111_BRGn_MTB_10961" )
     Description ( "Earliest all steel BR (SR) 4SUB Class405 4110 ~ 4120 series EMU.\n\n"+
 "Multiple Unit type: 4 car semi-fast suburban set of 2 MTB's and 2 trailer thirds \n\n"+
 "Power source: 660-750 volt DC third-rail equipped electric lines\n\n"+
 "Power: 550 hp\n\n"+
 "Max. speed: 75 mph\n\n"+
 "Coupling type: Screw couplings (Automatic) on outer coach ends"
 )
 EngineOperatingProcedures (
 "To move forward\n"+
  "1.  The unit is powered up for you. (If it is not for some reason, press the P key to turn on the power from the third rail.)\n"+
 "2. Press the W key to move the Reverser to Forward.\n"+
 "3. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "4. Press the D key to move the throttle from Idle to Notch 1.\n"+
 "5. Gradually increase power (D key), one notch at a time, until your train reaches the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the throttle to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+   
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
 "To release the train brakes\n"+
 "1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
 "To activate emergency braking\n"+
 "1. Press the A key to reduce the throttle to Idle.\n"+
 "2. Press the BACKSPACE key to activate emergency braking.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key to move the Reverser to the Reverse position.\n"+
 "4. Press the ; (SEMICOLON) key to release the brakes.\n"+
 "5. Slowly advance the throttle lever (D key).\n\n"+
 "To load and unload passengers\n"+
 "1. Stop at a station.\n"+
 "2. Press the ENTER key.\n"+
 "3. Wait for the 'permission to depart' signal.\n"+
 "TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 4 Km/h.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window."
 )
)